#### PartUtils Members

---

|  |
| --- |
| PartUtils Class   Methods   See Also |

The  PartUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AreElementsValidForCreateParts | Identifies if the given elements can be used to create parts. |
| Public method Static member | ArePartsValidForDivide | Identifies if provided members are valid for dividing parts. |
| Public method Static member | ArePartsValidForMerge | Identifies whether Part elements may be merged. |
| Public method Static member | CreateMergedPart | Create a single merged part which represents the Parts specified by partsToMerge. |
| Public method Static member | CreateParts(Document, ICollection ElementId ) | Creates a new set of parts out of the original elements. |
| Public method Static member | CreateParts(Document, ICollection LinkElementId ) | Creates a new set of parts out of the original elements. |
| Public method Static member | DivideParts | Creates divided parts out of parts. |
| Public method Static member | FindMergeableClusters | Segregates a set of elements into subsets which are valid for merge. |
| Public method Static member | GetAssociatedPartMaker(Document, ElementId) | Gets associated PartMaker for an element. |
| Public method Static member | GetAssociatedPartMaker(Document, LinkElementId) | Gets associated PartMaker for an element. |
| Public method Static member | GetAssociatedParts(Document, ElementId, Boolean, Boolean) | Returns all Parts that are associated with the given element. |
| Public method Static member | GetAssociatedParts(Document, LinkElementId, Boolean, Boolean) | Returns all Parts that are associated with the given element |
| Public method Static member | GetChainLengthToOriginal | Calculates the length of the longest chain of divisions/merges to reach to an original non-Part element that is the source of the tested part. |
| Public method Static member | GetMergedParts | Retrieves the element ids of the source elements of a merged part. |
| Public method Static member | GetPartMakerMethodToDivideVolumeFW | Obtains the object allowing access to the divided volume properties of the PartMaker. |
| Public method Static member | GetSplittingCurves(Document, ElementId) | Identifies the curves that were used to create the part. |
| Public method Static member | GetSplittingCurves(Document, ElementId, Plane ) | Identifies the curves that were used to create the part and the plane in which they reside. |
| Public method Static member | GetSplittingElements | Identifies the elements ( reference planes, levels, grids ) that were used to create the part. |
| Public method Static member | HasAssociatedParts(Document, ElementId) | Checks if an element has associated parts. |
| Public method Static member | HasAssociatedParts(Document, LinkElementId) | Checks if an element has associated parts. |
| Public method Static member | IsMergedPart | Is the Part the result of a merge. |
| Public method Static member | IsPartDerivedFromLink | Is the Part derived from link geometry. |
| Public method Static member | IsValidForCreateParts | Identifies if the given element can be used to create parts. |

# See Also

PartUtils Class

Autodesk.Revit.DB Namespace